libretiny-eu/libretiny/boards/wb2l/variant.h
/* This file was auto-generated from wb2l.json using boardgen */

#pragma once

#include <WVariant.h>

// clang-format off

// Pins
// ----
#define PINS_COUNT         13
#define NUM_DIGITAL_PINS   13
#define NUM_ANALOG_INPUTS  1
#define NUM_ANALOG_OUTPUTS 0

// Analog pins
// -----------
#define PIN_A0 11u    // GPIO23
#define A0     PIN_A0

// SPI Interfaces
// --------------
#define SPI_INTERFACES_COUNT 0

// Wire Interfaces
// ---------------
#define WIRE_INTERFACES_COUNT 2
#define PIN_WIRE1_SCL         9u  // GPIO20
#define PIN_WIRE1_SDA         10u // GPIO21
#define PIN_WIRE2_SCL         8u  // GPIO0
#define PIN_WIRE2_SDA         7u  // GPIO1

// Serial ports
// ------------
#define SERIAL_INTERFACES_COUNT 2
#define PIN_SERIAL1_RX          5u // GPIO10
#define PIN_SERIAL1_TX          6u // GPIO11
#define PIN_SERIAL2_RX          7u // GPIO1
#define PIN_SERIAL2_TX          8u // GPIO0
